# -*- coding: UTF-8 -*-
# 输入网页获得的TITLE，进行规则化处理
# 2017-9-15
# @author zf
import re


def clean_titles(title):
    i = 0
    # title = title.replace(';', '').replace('。', '')
    # title = title.replace('\ufeff', '')
    # title = title.replace('/', '').replace('！', '')
    # if "（" in title:
    #     Title_kuo = re.findall(r'\（(.*?)\）', title, re.S)
    #     Title_kuo = "（" + Title_kuo[0] + "）"
    #     title = title.replace(Title_kuo, '')
    # if "(" in title:
    #     Title_kuo = re.findall(r'\((.*?)\)', title, re.S)
    #     Title_kuo = "(" + Title_kuo[0] + ")"
    #     title = title.replace(Title_kuo, '')
    titles_list = re.split(r'[_\-—]', title)
    n_1 = 0
    # for list_AB in titles_list:  # 去除英文
    #     EN_str = re.findall(r'[a-zA-Z]+', list_AB)
    #     # print(EN_str)
    #     if EN_str:
    #         titles_list[n_1] = str(titles_list[n_1]).replace(str(EN_str[0]), '')
    #         # titles_list.remove(list_AB)
    #     n_1 = n_1 + 1
    n_2 = 0
    # if len(titles_list) >= 2: # 判断是否有“网”字，在什么地方
    #     for list_AB in titles_list:
    #         # print(len(list_AB))
    #         count = len(list_AB) - 1
    #         if count >= 1:
    #             if "网" in list_AB[count]:
    #                 # print(11111111111111111111111111111111111111)
    #                 print("不是新闻！！！！（非非）")
    #                 return "0"
    #             elif "网" in list_AB:
    #                 # print(list_AB+"12312312312312312312312132123")
    #                 titles_list[n_2] = str(titles_list[n_2]).replace(str(list_AB), '')
    #         n_2 = n_2 + 1
    n_3 = 0
    n_n = 0
    count = len(titles_list[0])
    for list_AB in titles_list:  # 取最长字符串
        count_3 = len(list_AB)
        if count_3 >= count:
            count = count_3
            n_n = n_3
        n_3 = n_3 + 1
    Titles = titles_list[n_n]
    # print(Titles)
    zhPattern = re.compile(u'[\u4e00-\u9fa5]+')  # 判断是否为中文
    match = zhPattern.search(Titles)
    if match:
        # Titles = re.sub('拥有梦想和未来的公司', '', Titles)
        # Titles = re.sub('首页', '', Titles)
        # Titles = re.sub('中文', '', Titles)
        # Titles = re.sub('欢迎', '', Titles)
        # Titles = re.sub('光临', '', Titles)
        # Titles = re.sub('官方', '', Titles)
        # Titles = re.sub('网站', '', Titles)
        # Titles = re.sub('您', '', Titles)
        # Titles = re.sub('！', '', Titles)
        # Titles = re.sub('!', '', Titles)
        Titles = re.sub(' ', '', Titles)
        Titles = re.sub('\n', '', Titles)
        Titles = re.sub('\r', '', Titles)
        if len(Titles) == 0:
            print("不是新闻！！！！(为空)")
            return "0"
            # print(Titles)  # 输出公司title
    else:
        print('非中文~！！！！')
        return "0"
    return Titles


if __name__ == '__main__':
    # if _table.find_one({"id": i}) is not None:
    bord = ("沪东中华造船集团有限公司", "芜湖造船厂迎来115岁生日 系中国五家百年船企之一-新安房产网", "\r\n        芜湖造船厂成功入围船企“白名单” - 船舶-产经新闻 :: 新闻中心_中钢网",
            "中国海洋综合调查船的摇篮——芜湖新联造船厂", "博物馆、民宿、坚果火锅......原来芜湖松鼠小镇是这样！-芜湖365淘房", "江苏扬子江船业集团公司",
            "芜湖造船厂有限公司",
            "中航鼎衡造船有限公司欢迎您！",
            "福建东南造船有限公司",
            "中航威海船厂有限公司",
            "青岛扬帆船舶制造有限公司 - - 青岛扬帆船舶制造有限公司",
            "中船黄埔",
            "中国船舶工业集团公司",
            "上海船厂船舶有限公司",
            "浙江增洲造船有限公司",
            "中船桂江造船有限公司",
            "中船澄西船舶修造有限公司",
            "江南造船有限责任公司",
            "荣成造船工业有限公司",
            "中船西江造船有限公司",
            "上海江南造船厂",
            "广州造船厂有限公司",
            "常石集团（舟山）造船有限公司",
            "同方江新造船有限公司",
            "外高桥造船有限公司(SWS)",
            "黄海造船|黄海造船有限公司 | 山东黄海造船| 黄海造船厂",
            "SouthChinaShipyard華南造船",
            "宁波新乐造船集团有限公司",
            "外高桥造船",
            "浙江方圆造船有限公司",
            "英辉南方造船（广州番禺）有限公司",
            "OceanLeaderShipbuildingCo.Ltd.中山利德豐造船有限公司",
            "上海船厂船舶有限公司|上海船厂船舶有限公司网站",
            "浙江长宏造船有限公司",
            "江苏正屿船舶重工有限公司",
            "靖江南洋船舶制造有限公司",
            "汕头造船厂",
            "厦门船舶重工股份有限公司",
            "福建新远造船有限公司|福建造船厂|福建造船公司|福建有什么船厂|福建船厂",
            "大连船舶工业公司（集团）",
            "江苏省无锡/苏洋船厂WUXISHIPYARD",
            "大连造船厂工具实业公司",
            "江苏省镇江船厂集团欢迎您",
            "浙江新洲造船有限公司",
            "中国扬帆集团官方网站",
            "æ°è…¾é€ èˆ¹æœ‰é™å…¬å¸",
            "江西江州联合造船有限责任公司",
            "浙江腾龙船厂",
            "新世纪集团",
            "文登市海通造船有限公司",
            "威海东海船舶修造有限公司",
            "网站首页-浙江欧华造船股份有限公司",
            "福建省马尾造船股份有限公司",
            "青岛松本造船有限公司｜青岛造船厂｜玻璃钢渔船｜游艇｜钓鱼艇｜观光艇｜公务艇",
            "扬州市团结造船厂",
            "中船桂江造船有限公司|中船桂江造船有限公司网站",
            "湖南宏宇造船有限公司|湖南造船厂|湖南造船公司|湖南船舶设计|船舶设计公司|造船厂|船舶配件|湖南船舶配件",
            "大宇造船海洋（山东）有限公司",
            "佛山造船公司|广东造船公司 | 佛山市南海珠峰造船有限公司",
            "启东丰顺船舶重工有限公司",
            "丹东丰奥船业有限公司",
            "福州兴顺造船有限公司",
            "神洲船业",
            "中船澄西新荣船舶有限公司",
            "福建鼎港船舶有限公司-福建造船厂",
            "大连船舶重工集团海洋工程有限公司",
            "白洋淀造船,造船,造船哪家好,白洋淀造船有限公司",
            "嘉兴浙北造船有限公司（原平湖东港船厂）",
            "首页||Home",
            "吉林市松航船舶修造有限公司|吉林船舶|吉林船厂|吉林造船|船舶修造|船舶建造",
            "舟山金平船舶修造有限责任公司(金平船厂)―舟山船舶修造、船舶修造修理",
            "南京东泽船舶制造有限公司",
            "福建国安船业",
            "昆明船舶设备集团有限公司官方网站",
            "浙江东方造船有限公司（原乐清市东方造船有限公司 ）|造船,修船,,,|船舶通会员",
            "浙江东方造船有限公司（原乐清市东方造船有限公司）|造船,修船,,,|船舶通会员",
            "国际船舶网-船厂、船舶、造船、船舶设备、航运及海洋工程等相关行业综合信息平台",
            "中船华南船舶机械有限公司",
            "天津新河船舶重工有限责任公司",
            "南通市通宝船舶有限公司",
            "无锡市兴隆船舶有限公司",
            "舟山长宏国际船舶修造有限公司",
            "南通港闸船舶制造有限公司|南通港闸船舶|南通港闸船舶制造|",
            "捷仕克造船工业科技有限公司-豪华游艇|高速快艇|休闲渔船|GCK",
            "重庆泽胜造船厂",
            "南通中远川崎船舶工程有限公司",
            "广东粤新海洋工程装备股份有限公司丨官方网站",
            "脚踏船、电动船、高速艇、画舫艇、冲锋舟、造船厂、龙舟船厂-造船厂",
            "上海外高桥造船有限公司",
            "高速艇，高速艇厂-专业高速艇造船厂-高速艇造船厂",
            "湘阴县湘南船厂",
            "香港六开彩白小姐图库【官网】白小姐彩图_一码中奖免费公开资料_香港马会开奖资料",
            "船舶修理，修船，船厂，船坞，船舶，江苏五峰山船舶工程有限公司>>首页",
            "台山市信和造船有限公司",
            "大连船舶工程技术研究中心有限公司",
            "天时造船_海洋工程船_集装箱船_甲板货船_科学考察船_沥青船_散货船-浙江天时造船有限公司",
            "泰州口岸船舶有限公司",
            "江阴扬子江船舶工程有限公司",
            "船舶C【广东江龙船舶制造有限公司】",
            "三福造船-欢迎光临泰州三福船舶工程有限公司！",
            "中国造船网_中国船舶工业集团公司指定电子商务平台,造船网首页|海事黄页|船舶采购|船舶供应|船舶招聘",
            ":::拥有梦想和未来的WorldBest公司:::",
            "山东游船,济南游船,山东船厂-山东省黄河航运局旅游船舶工程公司",
            "合肥建发船舶制造有限公司_合肥造船厂_建发船舶_合肥船厂_旅游船_环保船_交通船",
            "天中玻璃钢船艇有限公司网站", "船舶,中国船舶,船舶网,船舶设备,船舶采购,船舶公司,船舶新闻,中国船舶网",
            "扬州国裕船舶制造有限公司 船舶制造 散货船 船舶制造公司 12400吨散货船 30000吨散货船 57000吨散货船 45000吨的顶推驳船")
    for n in bord:
        print(clean_titles(n))
